package OOP_Homework1.carFactory2;

public class Engine {

}
/*Добавете класа Engine който да представлява двигателя на колата.
Двигателят има модел, мощност, обем и тип(дизел, бензин, хибридили електрическа).
Направете необходимите модификации в програмата т. че да удовлетворява следните условия:
Преди да започнете да произвеждате коли, трябва да произведете двигателите
и да им зададете стойности на полетата – поне по 1 от всеки тип.
След това в класа трябва да прочетете число N, обозначаващо броят на колите,
 които трябва да произведете за деня.*/