package OOP_Homework_Lesson_6;

public class Book_2 {

}
/*Копирайте класа Book от предишната задача и направете следните промени в него:

Добавете конструктор, който инициализира атрибутите.
Добавете toString() метод който връща String, съдържащ атрибутите на класа, подходящо форматирани.
Добавете и една статична константа която ще представлява брояч на книги.
Копирайте BookTest класа като направите следните промени в него:
Принтирайте меню на потребителя, където той може да избере
1. Да въведе книга или
2. Изход
Книгите да се въвеждат от конзолата като използвате Scanner.
(Валидирайте входните данни, за да избегнете грешки във вашата програма)
При въвеждането на всяка книга тогава стойността на брояча се увеличава с 1.
Когато потребителят избере Изход
тогава в конзолата се отпечатва броя на всички книги и toString-а на всяка една от тях.*/