package OOP_Homework_Lesson_6;

public class School {

}
/*Създайте клас School, който има име, списък от класове, списък от ученици.
Добавете в класа Student от предишната задача константа, която ще държи броя на учениците.
Създайте класа SchoolTest, в който ще се въвеждат от конзолата ученици.
Когато приключи въвеждането (Вие преценете как да стане това.
Може да ползвате същия начин като предишните задачи или нещо друго.),
изведете в конзолата общия брой въведени ученици и toString-a на всеки от тях.
Сега изведете всички, които ще са абитуриенти.
Извикайте goToNextClass() метода на всеки един от бъдещите абитуриенти.
 Нека той да принтира “Йееейй! Завърших!”
Сега изведете в конзолата общия брой ученици (Той променен ли е? Ако не е - оправете този бъг!)*/