package OOP_Homework_Lesson_6;

public class Student_2 {

}
/*В класа Student от задача Student направете следните промени:

Добавете метод void increaseAge(), който увеличава възрастта на ученика с 1 година.
Използвайте метод overloading, за да създадете метод void increaseAge(int years),
който увеличава възрастта на ученика с years на брой години.
Добавете и метод goToNextClass();
(Внимавайте! Класовете не се увеличават до безкрай! В даден момент ученикът ще завърши)
В StudentTest класа демонстрирайте как работят методите, които добавихте.*/