package OOP_Homework_Lesson_6;

public class Student {

}
/*Създайте клас Student който има следните атрибути:
lastName
firstName
age
schoolClass
Добавете конструктор, който приема за аргумент всички атрибути.
Добавете get и set методи за всеки атрибут.
Напишете toString метод, който принтира всички атрибути, форматирани по ваш избор.
 (За форматирането е подходящо да се ползва StringBuilder)
Създайте клас StudentTest, в който се създават трима студенти, като инициализирате атрибути със стойности по ваш избор.
За всеки Student принтирайте неговите toString методи.
НЕ ЗАБРАВЯЙТЕ ДА ПОДРЕЖДАТЕ КЛАСОВЕТЕ В ПАКЕТИ.*/