package OOP_Homework_Lesson_6;

public class Triangle {

}
/*Създайте клас Triangle който има:
3 страни
3 ъгъла
Може да създава триъгълник по 2 страни и ъгълът между тях.
(Тук ще трябва да използвате теореми от тригонометрията за да намерите останалите страни и ъгли.
Посъветвайте се с Google. Жокер: ще ви трябва косинусова теорема, евентуално,
зависи от вашия избор, намиране на някоя от височините, намиране на R, синусова теорема,
фактът, че сборът на ъглите в един триъгълник е 180 градуса).
Може да смята периметъра на триъгълника.
Може да смята лицето на триъгълника.
Може да генерира String във всичките ъгли и страни на триъгълника.
Напишете TriangleTest клас, който чете две страни и ъгъла между тях от конзолата.
(Не забравяйте да валидирате входните данни!)
Извежда в конзолата стойностите на трите страни на триъгълника, трите ъгъла, лицето и периметъра.*/