package Lec_17_Knowedge;

public class RakijaTime {

  public static void main(String[] args) {
    double sugar = 100.0 * .9;
    double rakia = 0.1 * sugar;
    double vinegar = 0.01 * rakia;
    int days = 2;
    while (rakia >vinegar) {
      sugar = sugar - 0.1 * sugar;
      rakia = 0.1 * sugar - 0.01 * rakia;
      vinegar = vinegar + 0.01 * rakia;
      days += 1;
    }
    System.out.println(days);
  }
}
/*Събрали сме плодове, направили сме си джибри и сега е време да преценим
 кога е най- добрият момент,
 в който да отидем до казана и да получим дълго чаканата си домашна ракийка.

Знаем, че процесът на ферментация е свързан с бактерии,
 които преработват захарта в алкохол.
Освен тези приятни бактерии обаче, има и едни други,
 не толкова дружелюбни бактерии, които преобразуват алкохола в оцет.

Ако приемем, че в началото на процеса имаме 100% захар.
За един ден бактериите преобразуват 10% (от наличната захар) в алкохол и 1% от алкохола в оцет.

След колко дни трябва да отидем до казана, така че да получим възможно най-много алкохол?*/